InformationRegisters/ОтсутствияНаОснованииОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтсутствияНаОснованииОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОтсутствия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОтсутствияНаОснованииОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьОтпускаСотрудниковОснования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьОтпускаСотрудниковОснования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтпускаСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьКомандировкиСотрудниковОснования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьКомандировкиСотрудниковОснования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомандировкиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьОтпускОснования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьОтпускОснования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьКомандировкаОснования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьКомандировкаОснования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОтпускаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОтпускаСотрудников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПринадлежности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОтпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРассчитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставитьМатериальнуюПомощьПриОтпуске</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставитьЕдиновременнуюВыплатуКОтпуску</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсвобождатьСтавку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпуск</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпускБезОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьСотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериодаЗаКоторыйПредоставляетсяОтпуск</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериодаЗаКоторыйПредоставляетсяОтпуск</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредоставитьЕдиновременнуюВыплатуКОтпуску</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьОтпуск</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтсутствияНаОснованииОбучения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПеренестиОтпускИКомандировкуВОтсутствияНаОснованииОбучения");
	Методы.Вставить("ПеренестиОтпускаКомандировкиВОтсутствияСотрудников");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументОтсутствия", "УправленческиеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЗаписиПоОтсутствиямСотрудника(Документ, Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтсутствияНаОснованииОбучения.ДокументОтсутствия,
	|	ОтсутствияНаОснованииОбучения.Сотрудник,
	|	ОтсутствияНаОснованииОбучения.Организация
	|ИЗ
	|	РегистрСведений.ОтсутствияНаОснованииОбучения КАК ОтсутствияНаОснованииОбучения
	|ГДЕ
	|	ОтсутствияНаОснованииОбучения.ДокументОснование = &ДокументОснование
	|	И ОтсутствияНаОснованииОбучения.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДокументОснование", Документ);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОтсутствия.Установить(Выборка.ДокументОтсутствия);
		НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ПеренестиОтпускаКомандировкиВОтсутствияСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	Обработанные = ЗначениеПараметраОбновленияОбработанные(ПараметрыОбновления);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьОтпускаСотрудниковОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьКомандировкиСотрудниковОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтсутствияНаОснованииОбучения");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудниковОснования.ОбъектСсылка КАК ДокументОтсутствия,
		|	ОтпускаСотрудниковОснования.Обучение КАК ДокументОснование,
		|	ОтпускаСотрудниковОснования.Организация
		|ПОМЕСТИТЬ ВТДокументыКПереносу
		|ИЗ
		|	РегистрСведений.УдалитьОтпускаСотрудниковОснования КАК ОтпускаСотрудниковОснования
		|ГДЕ
		|	НЕ ОтпускаСотрудниковОснования.ОбъектСсылка В (&Обработанные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомандировкиСотрудниковОснования.ОбъектСсылка КАК ДокументОтсутствия,
		|	КомандировкиСотрудниковОснования.Обучение КАК ДокументОснование,
		|	КомандировкиСотрудниковОснования.Организация
		|ИЗ
		|	РегистрСведений.УдалитьКомандировкиСотрудниковОснования КАК КомандировкиСотрудниковОснования
		|ГДЕ
		|	НЕ КомандировкиСотрудниковОснования.ОбъектСсылка В (&Обработанные)";
	
	
		Запрос.УстановитьПараметр("Обработанные", Обработанные);

		ОбновляемыеДанные = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТДокументыКПереносу");
	
		Если ОбновляемыеДанные.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
	
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
		Запрос.Текст = "ВЫБРАТЬ
		|	ДокументыКПереносу.ДокументОтсутствия КАК ДокументОтсутствия,
		|	ДокументыКПереносу.ДокументОснование,
		|	ДокументыКПереносу.Организация,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДокументыКПереносу.ДокументОтсутствия) = Тип(Документ.ОтпускаСотрудников)
		|			ТОГДА ОтпускаСотрудниковСотрудники.Сотрудник
		|		ИНАЧЕ КомандировкиСотрудниковСотрудники.Сотрудник
		|	КОНЕЦ КАК Сотрудник
		|ИЗ
		|	ВТДокументыКПереносу КАК ДокументыКПереносу
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаСотрудников.Сотрудники КАК ОтпускаСотрудниковСотрудники
		|		ПО ДокументыКПереносу.ДокументОтсутствия = ОтпускаСотрудниковСотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомандировкиСотрудников.Сотрудники КАК КомандировкиСотрудниковСотрудники
		|		ПО ДокументыКПереносу.ДокументОтсутствия = КомандировкиСотрудниковСотрудники.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОтсутствия";
	
		Выборка = Запрос.Выполнить().Выбрать();
		НовыеОбработанные = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ДокументОтсутствия") Цикл
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОтсутствия.Установить(Выборка.ДокументОтсутствия);
			Пока Выборка.Следующий() Цикл 
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			НовыеОбработанные.Добавить(Выборка.ДокументОтсутствия);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Для Каждого ОбработанныйДокумент Из НовыеОбработанные Цикл
			Обработанные.Добавить(ОбработанныйДокумент);
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

Процедура ПеренестиОтпускИКомандировкуВОтсутствияНаОснованииОбучения(ПараметрыОбновления = Неопределено) Экспорт
	
	Обработанные = ЗначениеПараметраОбновленияОбработанные(ПараметрыОбновления);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьОтпускОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьКомандировкаОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтсутствияНаОснованииОбучения");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтпускОснования.ОбъектСсылка КАК ДокументОтсутствия,
		|	ОтпускОснования.Обучение КАК ДокументОснование,
		|	ОтпускОснования.Организация КАК Организация,
		|	ОтпускОснования.ОбъектСсылка.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.УдалитьОтпускОснования КАК ОтпускОснования
		|ГДЕ
		|	НЕ ОтпускОснования.ОбъектСсылка В (&Обработанные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомандировкаОснования.ОбъектСсылка,
		|	КомандировкаОснования.Обучение,
		|	КомандировкаОснования.Организация,
		|	КомандировкаОснования.ОбъектСсылка.Сотрудник
		|ИЗ
		|	РегистрСведений.УдалитьКомандировкаОснования КАК КомандировкаОснования
		|ГДЕ
		|	НЕ КомандировкаОснования.ОбъектСсылка В (&Обработанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОтсутствия";
	
		Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
		ОбновляемыеДанные = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);

		Если ОбновляемыеДанные.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
	
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
		Выборка = ОбновляемыеДанные.Выбрать();

		НовыеОбработанные = Новый Массив;
		
		Пока Выборка.Следующий() Цикл 
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОтсутствия.Установить(Выборка.ДокументОтсутствия);
			НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			НовыеОбработанные.Добавить(Выборка.ДокументОтсутствия);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Для Каждого ОбработанныйДокумент Из НовыеОбработанные Цикл
			Обработанные.Добавить(ОбработанныйДокумент);
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);

КонецПроцедуры

Функция ЗначениеПараметраОбновленияОбработанные(ПараметрыОбновления)
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") 
		Или ПараметрыОбновления.Обработанные = Неопределено Тогда
		ПараметрыОбновления.Вставить("Обработанные", Новый Массив);
	КонецЕсли;
	
	Возврат ПараметрыОбновления.Обработанные;
	
КонецФункции

#КонецОбласти

Функция ОснованиеДокументаОтсутствия(ДокументОтсутствия) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбучениеРазвитиеСотрудников")
		Или Не ПравоДоступа("Чтение", Метаданные.Документы.ОбучениеРазвитиеСотрудников) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОтсутствия", ДокументОтсутствия);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
		|	ОтсутствияНаОснованииОбучения.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ОтсутствияНаОснованииОбучения КАК ОтсутствияНаОснованииОбучения
		|ГДЕ
		|	ОтсутствияНаОснованииОбучения.ДокументОтсутствия = &ДокументОтсутствия";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ДокументОснование, Неопределено);
	
КонецФункции

#КонецОбласти

#КонецЕсли
